driver-tests/bpelse/assign/VariablePropertyTest/VariableProperty1Bpel/src/InCopyFrom9/InCopyFrom9.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="InCopyFrom9" targetNamespace="http://j2ee.netbeans.org/wsdl/InCopyFrom9"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/InCopyFrom9" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns0="http://xml.netbeans.org/schema/simple" xmlns:vprop="http://docs.oasis-open.org/wsbpel/2.0/varprop">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/InCopyFrom9" xmlns:ns0="http://xml.netbeans.org/schema/simple">
            <xsd:import schemaLocation="../simple.xsd" namespace="http://xml.netbeans.org/schema/simple"/>
        </xsd:schema>
    </types>
    <message name="InCopyFrom9OperationRequest">
        <part name="inputPart" element="ns0:itemElem"/>
    </message>
    <message name="InCopyFrom9OperationResponse">
        <part name="outputPart" type="xsd:string"/>
    </message>
    <portType name="InCopyFrom9PortType">
        <operation name="InCopyFrom9Operation">
            <input name="input1" message="tns:InCopyFrom9OperationRequest"/>
            <output name="output1" message="tns:InCopyFrom9OperationResponse"/>
        </operation>
    </portType>
    <binding name="InCopyFrom9Binding" type="tns:InCopyFrom9PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="InCopyFrom9Operation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InCopyFrom9"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InCopyFrom9"/>
            </output>
        </operation>
    </binding>
    <service name="InCopyFrom9Service">
        <port name="InCopyFrom9Port" binding="tns:InCopyFrom9Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/InCopyFrom9Service/InCopyFrom9Port"/>
        </port>
    </service>
    <plnk:partnerLinkType name="InCopyFrom9">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="InCopyFrom9PortTypeRole" portType="tns:InCopyFrom9PortType"/>
    </plnk:partnerLinkType>
    <vprop:property name="intProperty" type="xsd:int"/>
    <vprop:property name="boolProperty" type="xsd:boolean"/>
    <vprop:propertyAlias propertyName="tns:intProperty" element="ns0:itemElem">
        <vprop:query>ns0:price</vprop:query>
    </vprop:propertyAlias>
    <vprop:propertyAlias propertyName="tns:boolProperty" element="ns0:itemElem">
        <vprop:query>ns0:itemAvailable</vprop:query>
    </vprop:propertyAlias>
    <vprop:propertyAlias propertyName="tns:intProperty" type="xsd:int"/>
    <vprop:propertyAlias propertyName="tns:boolProperty" type="xsd:boolean"/>
</definitions>
