driver-tests/bpelse/assign/VariablePropertyTest/VariableProperty1Jbi/test/InCopyFrom9/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://j2ee.netbeans.org/wsdl/InCopyFrom9" xmlns:sim="http://xml.netbeans.org/schema/simple">
  <soapenv:Body>
    <inc:InCopyFrom9Operation>
      <inputPart>
        <sim:itemElem>
          <sim:itemName>pen</sim:itemName>
          <sim:price>15</sim:price>
          <sim:itemAvailable>false</sim:itemAvailable>
        </sim:itemElem>
      </inputPart>
    </inc:InCopyFrom9Operation>
  </soapenv:Body>
</soapenv:Envelope>